v2206/Projects/solverTests/ADTank_orig/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// endTime         60;
endTime         200;
deltaT          1;

adjustableRunTime yes; 

writeControl    runTime;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   5;

runTimeModifiable true;

functions
{
    // #includeFunc mag(U)

	linesample_00
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.009587131702242374  -0.10958141679009199  0.0);
				end					(0.009587131702242398  0.10958141679009199  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_01
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.028470094961277243  -0.10625184089179754  0.0);
				end					(0.02847009496127729  0.10625184089179752  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_02
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.04648800879147692  -0.0996938565740315  0.0);
				end					(0.04648800879147693  0.09969385657403149  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_03
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.06309340799861503  -0.09010672487178914  0.0);
				end					(0.06309340799861504  0.09010672487178913  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_04
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.07778174593052022  -0.07778174593052024  0.0);
				end					(0.07778174593052022  0.07778174593052024  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_05
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.09010672487178908  -0.0630934079986151  0.0);
				end					(0.0901067248717891  0.06309340799861508  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_06
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.09969385657403144  -0.04648800879147699  0.0);
				end					(0.09969385657403147  0.04648800879147696  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_07
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.1062518408917975  -0.028470094961277368  0.0);
				end					(0.10625184089179752  0.028470094961277306  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_08
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.10958141679009199  -0.009587131702242506  0.0);
				end					(0.10958141679009199  0.009587131702242417  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_09
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.10958141679009199  0.009587131702242367  0.0);
				end					(0.10958141679009199  -0.009587131702242381  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_10
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.10625184089179754  0.02847009496127724  0.0);
				end					(0.10625184089179754  -0.028470094961277274  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_11
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.09969385657403151  0.046488008791476874  0.0);
				end					(0.0996938565740315  -0.04648800879147693  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_12
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.09010672487178915  0.06309340799861499  0.0);
				end					(0.09010672487178913  -0.06309340799861503  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_13
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.07778174593052031  0.07778174593052015  0.0);
				end					(0.07778174593052024  -0.07778174593052022  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_14
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.0630934079986151  0.09010672487178907  0.0);
				end					(0.06309340799861508  -0.09010672487178908  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_15
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.046488008791477  0.09969385657403144  0.0);
				end					(0.046488008791476944  -0.09969385657403149  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_16
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.02847009496127728  0.10625184089179752  0.0);
				end					(0.02847009496127727  -0.10625184089179754  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}

	linesample_17
	{
		type						sets;
		libs						("libsampling.so");
		writeControl				$writeControl;
		writeInterval				2;
		interpolationScheme			cell;
		setFormat					csv;
		sets						(
			data
			{
				type				uniform;
				axis				xyz;
				start				(-0.009587131702242416  0.10958141679009199  0.0);
				end					(0.009587131702242402  -0.10958141679009199  0.0);
				nPoints				500;
			}
		);
		fields	(U);
	}


}


// ************************************************************************* //
